raphaelchang/battman-firmware/ChibiOS_16.1.4/os/hal/ports/SPC5/SPC56ECxx/spc56ec_registry.h
/*
    SPC5 HAL - Copyright (C) 2013 STMicroelectronics

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    SPC56ECxx/spc56ec_registry.h
 * @brief   SPC56ECxx capabilities registry.
 *
 * @addtogroup HAL
 * @{
 */

#ifndef _SPC56EC_REGISTRY_H_
#define _SPC56EC_REGISTRY_H_

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

#if defined(_SPC564B64L7_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       147

#elif defined(_SPC564B70L7_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       147

#elif defined(_SPC564B74L7_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       147

#elif defined(_SPC564B64L8_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       177

#elif defined(_SPC564B70L8_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       177

#elif defined(_SPC564B74L8_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       177

#elif defined(_SPC56EC64B3_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       199

#elif defined(_SPC56EC64L7_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       147

#elif defined(_SPC56EC64L8_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       177

#elif defined(_SPC56EC70B3_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       199

#elif defined(_SPC56EC70L7_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       147

#elif defined(_SPC56EC70L8_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       177

#elif defined(_SPC56EC74B3_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       199

#elif defined(_SPC56EC74L7_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       147

#elif defined(_SPC56EC74L8_)
#define SPC5_NUM_DSPI                       8
#define SPC5_NUM_LINFLEX                    10
#define SPC5_NUM_GPIO                       177

#else
#error "SPC56ECxx platform not defined"
#endif

/*===========================================================================*/
/* Platform capabilities.                                                    */
/*===========================================================================*/

/**
 * @name    SPC560Bxx capabilities
 * @{
 */
/* DSPI attribures.*/
#define SPC5_DSPI_FIFO_DEPTH                4

#if SPC5_NUM_DSPI > 0
#define SPC5_HAS_DSPI0                      TRUE
#define SPC5_DSPI0_PCTL                     4
#define SPC5_DSPI0_TX1_DMA_DEV_ID           1
#define SPC5_DSPI0_TX2_DMA_DEV_ID           0
#define SPC5_DSPI0_RX_DMA_DEV_ID            2
#define SPC5_DSPI0_TFFF_HANDLER             vector76
#define SPC5_DSPI0_TFFF_NUMBER              76
#define SPC5_DSPI0_RFDF_HANDLER             vector78
#define SPC5_DSPI0_RFDF_NUMBER              78
#define SPC5_DSPI0_ENABLE_CLOCK()                                           \
  halSPCSetPeripheralClockMode(SPC5_DSPI0_PCTL, SPC5_SPI_DSPI0_START_PCTL)
#define SPC5_DSPI0_DISABLE_CLOCK()                                          \
  halSPCSetPeripheralClockMode(SPC5_DSPI0_PCTL, SPC5_SPI_DSPI0_STOP_PCTL)
#else
#define SPC5_HAS_DSPI0                      FALSE
#endif

#if SPC5_NUM_DSPI > 1
#define SPC5_HAS_DSPI1                      TRUE
#define SPC5_DSPI1_PCTL                     5
#define SPC5_DSPI1_TX1_DMA_DEV_ID           3
#define SPC5_DSPI1_TX2_DMA_DEV_ID           0
#define SPC5_DSPI1_RX_DMA_DEV_ID            4
#define SPC5_DSPI1_TFFF_HANDLER             vector96
#define SPC5_DSPI1_TFFF_NUMBER              96
#define SPC5_DSPI1_RFDF_HANDLER             vector98
#define SPC5_DSPI1_RFDF_NUMBER              98
#define SPC5_DSPI1_ENABLE_CLOCK()                                           \
  halSPCSetPeripheralClockMode(SPC5_DSPI1_PCTL, SPC5_SPI_DSPI1_START_PCTL)
#define SPC5_DSPI1_DISABLE_CLOCK()                                          \
  halSPCSetPeripheralClockMode(SPC5_DSPI1_PCTL, SPC5_SPI_DSPI1_STOP_PCTL)
#else
#define SPC5_HAS_DSPI1                      FALSE
#endif

#if SPC5_NUM_DSPI > 2
#define SPC5_HAS_DSPI2                      TRUE
#define SPC5_DSPI2_PCTL                     6
#define SPC5_DSPI2_TX1_DMA_DEV_ID           5
#define SPC5_DSPI2_TX2_DMA_DEV_ID           0
#define SPC5_DSPI2_RX_DMA_DEV_ID            6
#define SPC5_DSPI2_TFFF_HANDLER             vector116
#define SPC5_DSPI2_TFFF_NUMBER              116
#define SPC5_DSPI2_RFDF_HANDLER             vector118
#define SPC5_DSPI2_RFDF_NUMBER              118
#define SPC5_DSPI2_ENABLE_CLOCK()                                           \
  halSPCSetPeripheralClockMode(SPC5_DSPI2_PCTL, SPC5_SPI_DSPI2_START_PCTL)
#define SPC5_DSPI2_DISABLE_CLOCK()                                          \
  halSPCSetPeripheralClockMode(SPC5_DSPI2_PCTL, SPC5_SPI_DSPI2_STOP_PCTL)
#else
#define SPC5_HAS_DSPI2                      FALSE
#endif

#if SPC5_NUM_DSPI > 3
#define SPC5_HAS_DSPI3                      TRUE
#define SPC5_DSPI3_PCTL                     7
#define SPC5_DSPI3_TX1_DMA_DEV_ID           7
#define SPC5_DSPI3_TX2_DMA_DEV_ID           0
#define SPC5_DSPI3_RX_DMA_DEV_ID            8
#define SPC5_DSPI3_TFFF_HANDLER             vector184
#define SPC5_DSPI3_TFFF_NUMBER              184
#define SPC5_DSPI3_RFDF_HANDLER             vector186
#define SPC5_DSPI3_RFDF_NUMBER              186
#define SPC5_DSPI3_ENABLE_CLOCK()                                           \
  halSPCSetPeripheralClockMode(SPC5_DSPI3_PCTL, SPC5_SPI_DSPI3_START_PCTL)
#define SPC5_DSPI3_DISABLE_CLOCK()                                          \
  halSPCSetPeripheralClockMode(SPC5_DSPI3_PCTL, SPC5_SPI_DSPI3_STOP_PCTL)
#else
#define SPC5_HAS_DSPI3                      FALSE
#endif

